Revit 2026 API

# ItemFactoryBaseNewFamilyInstance(XYZ, FamilySymbol, Element, StructuralType) Method

---

Inserts a new instance of a family into the document, using a location, type/symbol, and the host element.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyInstance NewFamilyInstance(
	XYZ location,
	FamilySymbol symbol,
	Element host,
	StructuralType structuralType
)
```
```vb
Public Function NewFamilyInstance (
	location As XYZ,
	symbol As FamilySymbol,
	host As Element,
	structuralType As StructuralType
) As FamilyInstance
```
```cpp
public:
FamilyInstance^ NewFamilyInstance(
	XYZ^ location,
	FamilySymbol^ symbol,
	Element^ host,
	StructuralType structuralType
)
```
```fsharp
member NewFamilyInstance :
        location : XYZ *
        symbol : FamilySymbol *
        host : Element *
        structuralType : StructuralType -> FamilyInstance
```

#### Parameters

location XYZ
    The physical location where the instance is to be placed.
symbol FamilySymbol
    A FamilySymbol object that represents the type of the instance that is to be inserted.
host Element
    The object into which the FamilyInstance is to be inserted, often known as the host.
structuralType StructuralType
     If structural then specify the type of the component.

#### Return Value

FamilyInstanceIf creation was successful then an instance to the new object is returned, otherwise .

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown if The symbol is not active. |

This method is used to insert one family instance into another element, such as inserting a window into a wall. If the instance fails to be created an exception may be thrown.

The type/symbol that is used must be loaded into the document before this method is called. Families and their symbols can be loaded using the Document.LoadFamily or Document.LoadFamilySymbol methods.

The host object must be one that supports insertion of instances otherwise this method will fail.

Some Families, such as Beams, have more than one endpoint and are inserted in the same manner as single point instances. Once inserted these linear family instances can have their endpoints changed by using the instance's Element.Location property.

Note: ForbiddenForDynamicUpdateException might be thrown during a dynamic update if the inserted instance establishes a mutual dependency with another structure.

Note: if the created family instance includes nested instances, the API framework will automatically regenerate the document during this method call.

#### Reference

ItemFactoryBase Class

NewFamilyInstance Overload

Autodesk.Revit.Creation Namespace